/*
求10000~99999之间不带4的数的个数。 
*/

///////////////////////////////////
//逐位判断
/////////////////////////////////// 
#include <iostream>
using namespace std;

int main()
{
	int a,b,c,d,e;
	int n=0;
	
	for(a=1;a<=9;a++)
	{
		for(b=0;b<=9;b++)
		{
			for(c=0;c<=9;c++)
			{
				for(d=0;d<=9;d++)
				{
					for(e=0;e<=9;e++)
					{
						if(a!=4&&b!=4&&c!=4&&e!=4&&d!=4)
							n++;
					}
				}
			}
		}
	}
	
	cout<<"最多可发出的奖券数为： "<<n<<endl;

	return 0;
}



//////////////////////////////////////////////////////
//求带四的 
//////////////////////////////////////////////////////
									                /*
#include <iostream>
using namespace std;

int main()
{
	int i,n=0;
	
	for (i=10000;i<100000;i++)
	{
		int r=0;
		if (i%10==4)
			n++,r++;
		if (((i/10)%10==4)&&(r==0))
			n++,r++;
		if (((i/100)%10==4)&&(r==0))
			n++,r++;
		if (((i/1000)%10==4)&&(r==0))
			n++,r++;	
		if (((i/1000)%10==4)&&(r==0))
			n++;
	}	
	
	cout<<"最多可发出的奖券数为： "<<90000-n<<endl;
	
	return 0;
}
							        		*/
 

///////////////////////////////////////////// 
//求不带四的 
/////////////////////////////////////////////
							            	/*
#include <iostream>
using namespace std;

int main()
{
	int i,n=0;
	for (i=10000;i<100000;i++)
	{
		if 	(
			(i%10!=4)&&((i/10)%10!=4)&&((i/100)%10!=4)&&
			((i/1000)%10!=4)&&((i/10000)%10!=4) 
			)
		n++;	
	}	
	cout<<"最多可发出的奖券数为： "<<n<<endl;

	return 0;	
}
											*/


//暂时没有别的思路了。
